package a1introduce;

/**
 * @author Eva   Email:
 * @Description  命名规则
 * @data 2023/1/6 10:46
 */
public class CName {
    /*
    标识符的命名规范
        大小写敏感
        类名和源文件名：首字母大写，一致
        标识符：数字（不能开头）、字母、下划线、美元符；关键字不能(关键字和保留字,关键字都是小写)

        标识符命名规范：
        包名： 多个单词小写 helloworld
        类名、接口名： 驼峰命名法，首字母大写  HelloWorld
        变量名、方法名：驼峰命名法，首字母小写  helloWorld
        常量名：所有字母都大写，多个单词用下划线连接：HELLO_WORLD
                final(虽然常量名也可以用小写，但为了便于识别，通常使用大写字母表示常量)
        见名知意；Java使用unicode编码，是可以使用中文的，但是不建议使用


    主方法入口：所有的 Java 程序由 public static void main(String[] args) 方法开始执行
    源文件名：源文件名必须和类名相同。当保存文件的时候，你应该使用类名作为文件名保存（切记 Java 是大小写敏感的），
            文件名的后缀为 .java。（如果文件名和类名不相同则会导致编译错误）。

     */


// 组成：数字（不能开头）、字母、下划线、美元符
//包名、文件名、类名、接口名、方法名、变量名、常量名
}
